## staging: rds
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

**⚠️ &nbsp; Warning:** resources will be destroyed by this change!
```terraform
Plan: 4 to add, 1 to change, 4 to destroy
```

<details>
<summary>Show summary</summary>

|  CHANGE  |                              NAME                              |
|----------|----------------------------------------------------------------|
| recreate | `aws_rds_cluster.notification-canada-ca`                       |
|          | `aws_rds_cluster_instance.notification-canada-ca-instances[0]` |
|          | `aws_rds_cluster_instance.notification-canada-ca-instances[1]` |
|          | `aws_rds_cluster_instance.notification-canada-ca-instances[2]` |
| update   | `aws_kms_key.rds_snapshot[0]`                                  |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_kms_key.rds_snapshot[0] will be updated in-place
  ~ resource "aws_kms_key" "rds_snapshot" {
        id                                 = "95792326-c848-4b7d-b800-9501f876e742"
      # Warning: this attribute value will be marked as sensitive and will not
      # display in UI output after applying this change. The value is unchanged.
      ~ policy                             = (sensitive value)
        tags                               = {}
        # (14 unchanged attributes hidden)
    }

  # aws_rds_cluster.notification-canada-ca must be replaced
-/+ resource "aws_rds_cluster" "notification-canada-ca" {
      ~ allocated_storage                     = 1 -> (known after apply)
      + apply_immediately                     = (known after apply)
      ~ arn                                   = "arn:aws:rds:ca-central-1:239043911459:cluster:notification-canada-ca-staging-cluster" -> (known after apply)
      ~ availability_zones                    = [
          - "ca-central-1a",
          - "ca-central-1b",
          - "ca-central-1d",
        ] -> (known after apply)
      - backtrack_window                      = 0 -> null
      + ca_certificate_identifier             = (known after apply)
      + ca_certificate_valid_till             = (known after apply)
      + cluster_identifier_prefix             = (known after apply)
      ~ cluster_members                       = [
          - "notification-canada-ca-staging-instance-0",
          - "notification-canada-ca-staging-instance-1",
          - "notification-canada-ca-staging-instance-2",
        ] -> (known after apply)
      ~ cluster_resource_id                   = "cluster-UB3YOTSGSXHZFGGZZFFVLBWSWY" -> (known after apply)
      + db_system_id                          = (known after apply)
      + enable_local_write_forwarding         = false
      ~ endpoint                              = "notification-canada-ca-staging-cluster.cluster-cjxcfmgad2pq.ca-central-1.rds.amazonaws.com" -> (known after apply)
      ~ engine_lifecycle_support              = "open-source-rds-extended-support" -> (known after apply)
      ~ engine_version_actual                 = "15.5" -> (known after apply)
      ~ hosted_zone_id                        = "Z1JG78A3UK1DU3" -> (known after apply)
      - iam_database_authentication_enabled   = false -> null
      ~ iam_roles                             = [] -> (known after apply)
      ~ id                                    = "notification-canada-ca-staging-cluster" -> (known after apply)
      - iops                                  = 0 -> null
      ~ kms_key_id                            = "arn:aws:kms:ca-central-1:239043911459:key/231bec5f-3436-45e7-a534-59e4d49bed87" -> (known after apply)
      ~ master_user_secret                    = [] -> (known after apply)
      + master_user_secret_kms_key_id         = (known after apply)
      ~ network_type                          = "IPV4" -> (known after apply)
      - performance_insights_enabled          = false -> null
      + performance_insights_kms_key_id       = (known after apply)
      ~ performance_insights_retention_period = 0 -> (known after apply)
      ~ port                                  = 5432 -> (known after apply)
      ~ reader_endpoint                       = "notification-canada-ca-staging-cluster.cluster-ro-cjxcfmgad2pq.ca-central-1.rds.amazonaws.com" -> (known after apply)
      + snapshot_identifier                   = (sensitive value) # forces replacement
      + storage_type                          = (known after apply)
        tags                                  = {
            "CostCenter" = "notification-canada-ca-staging"
        }
        # (28 unchanged attributes hidden)
    }

  # aws_rds_cluster_instance.notification-canada-ca-instances[0] must be replaced
-/+ resource "aws_rds_cluster_instance" "notification-canada-ca-instances" {
      ~ arn                                   = "arn:aws:rds:ca-central-1:239043911459:db:notification-canada-ca-staging-instance-0" -> (known after apply)
      ~ availability_zone                     = "ca-central-1b" -> (known after apply)
      ~ cluster_identifier                    = "notification-canada-ca-staging-cluster" # forces replacement -> (known after apply) # forces replacement
      ~ db_parameter_group_name               = "default.aurora-postgresql15" -> (known after apply)
      ~ dbi_resource_id                       = "db-7ZHWUNY63FW3RLJM4VMULZAPXI" -> (known after apply)
      ~ endpoint                              = "notification-canada-ca-staging-instance-0.cjxcfmgad2pq.ca-central-1.rds.amazonaws.com" -> (known after apply)
      ~ engine_version_actual                 = "15.5" -> (known after apply)
      ~ id                                    = "notification-canada-ca-staging-instance-0" -> (known after apply)
      + identifier_prefix                     = (known after apply)
      ~ kms_key_id                            = "arn:aws:kms:ca-central-1:239043911459:key/231bec5f-3436-45e7-a534-59e4d49bed87" -> (known after apply)
      + monitoring_role_arn                   = (known after apply)
      ~ network_type                          = "IPV4" -> (known after apply)
      ~ performance_insights_kms_key_id       = "arn:aws:kms:ca-central-1:239043911459:key/231bec5f-3436-45e7-a534-59e4d49bed87" -> (known after apply)
      ~ performance_insights_retention_period = 7 -> (known after apply)
      ~ port                                  = 5432 -> (known after apply)
      ~ preferred_backup_window               = "07:00-09:00" -> (known after apply)
      ~ publicly_accessible                   = false -> (known after apply)
      ~ storage_encrypted                     = true -> (known after apply)
        tags                                  = {
            "CostCenter" = "notification-canada-ca-staging"
        }
      ~ writer                                = false -> (known after apply)
        # (15 unchanged attributes hidden)
    }

  # aws_rds_cluster_instance.notification-canada-ca-instances[1] must be replaced
-/+ resource "aws_rds_cluster_instance" "notification-canada-ca-instances" {
      ~ arn                                   = "arn:aws:rds:ca-central-1:239043911459:db:notification-canada-ca-staging-instance-1" -> (known after apply)
      ~ availability_zone                     = "ca-central-1a" -> (known after apply)
      ~ cluster_identifier                    = "notification-canada-ca-staging-cluster" # forces replacement -> (known after apply) # forces replacement
      ~ db_parameter_group_name               = "default.aurora-postgresql15" -> (known after apply)
      ~ dbi_resource_id                       = "db-2RRU2VCLTVLGLJGASOQ6ACQ6RE" -> (known after apply)
      ~ endpoint                              = "notification-canada-ca-staging-instance-1.cjxcfmgad2pq.ca-central-1.rds.amazonaws.com" -> (known after apply)
      ~ engine_version_actual                 = "15.5" -> (known after apply)
      ~ id                                    = "notification-canada-ca-staging-instance-1" -> (known after apply)
      + identifier_prefix                     = (known after apply)
      ~ kms_key_id                            = "arn:aws:kms:ca-central-1:239043911459:key/231bec5f-3436-45e7-a534-59e4d49bed87" -> (known after apply)
      + monitoring_role_arn                   = (known after apply)
      ~ network_type                          = "IPV4" -> (known after apply)
      ~ performance_insights_kms_key_id       = "arn:aws:kms:ca-central-1:239043911459:key/231bec5f-3436-45e7-a534-59e4d49bed87" -> (known after apply)
      ~ performance_insights_retention_period = 7 -> (known after apply)
      ~ port                                  = 5432 -> (known after apply)
      ~ preferred_backup_window               = "07:00-09:00" -> (known after apply)
      ~ publicly_accessible                   = false -> (known after apply)
      ~ storage_encrypted                     = true -> (known after apply)
        tags                                  = {
            "CostCenter" = "notification-canada-ca-staging"
        }
      ~ writer                                = false -> (known after apply)
        # (15 unchanged attributes hidden)
    }

  # aws_rds_cluster_instance.notification-canada-ca-instances[2] must be replaced
-/+ resource "aws_rds_cluster_instance" "notification-canada-ca-instances" {
      ~ arn                                   = "arn:aws:rds:ca-central-1:239043911459:db:notification-canada-ca-staging-instance-2" -> (known after apply)
      ~ availability_zone                     = "ca-central-1d" -> (known after apply)
      ~ cluster_identifier                    = "notification-canada-ca-staging-cluster" # forces replacement -> (known after apply) # forces replacement
      ~ db_parameter_group_name               = "default.aurora-postgresql15" -> (known after apply)
      ~ dbi_resource_id                       = "db-2GVJQVB4ACXIBRH4M542DMTGZM" -> (known after apply)
      ~ endpoint                              = "notification-canada-ca-staging-instance-2.cjxcfmgad2pq.ca-central-1.rds.amazonaws.com" -> (known after apply)
      ~ engine_version_actual                 = "15.5" -> (known after apply)
      ~ id                                    = "notification-canada-ca-staging-instance-2" -> (known after apply)
      + identifier_prefix                     = (known after apply)
      ~ kms_key_id                            = "arn:aws:kms:ca-central-1:239043911459:key/231bec5f-3436-45e7-a534-59e4d49bed87" -> (known after apply)
      + monitoring_role_arn                   = (known after apply)
      ~ network_type                          = "IPV4" -> (known after apply)
      ~ performance_insights_kms_key_id       = "arn:aws:kms:ca-central-1:239043911459:key/231bec5f-3436-45e7-a534-59e4d49bed87" -> (known after apply)
      ~ performance_insights_retention_period = 7 -> (known after apply)
      ~ port                                  = 5432 -> (known after apply)
      ~ preferred_backup_window               = "07:00-09:00" -> (known after apply)
      ~ publicly_accessible                   = false -> (known after apply)
      ~ storage_encrypted                     = true -> (known after apply)
        tags                                  = {
            "CostCenter" = "notification-canada-ca-staging"
        }
      ~ writer                                = true -> (known after apply)
        # (15 unchanged attributes hidden)
    }

Plan: 4 to add, 1 to change, 4 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.logs_exports"]
WARN - plan.json - main - Missing Common Tags: ["aws_db_event_subscription.notification-canada-ca"]
WARN - plan.json - main - Missing Common Tags: ["aws_db_event_subscription.notification-canada-ca-cluster"]
WARN - plan.json - main - Missing Common Tags: ["aws_db_subnet_group.notification-canada-ca"]
WARN - plan.json - main - Missing Common Tags: ["aws_kms_key.rds_snapshot[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_rds_cluster.notification-canada-ca"]
WARN - plan.json - main - Missing Common Tags: ["aws_rds_cluster_instance.notification-canada-ca-instances[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_rds_cluster_instance.notification-canada-ca-instances[1]"]
WARN - plan.json - main - Missing Common Tags: ["aws_rds_cluster_instance.notification-canada-ca-instances[2]"]
WARN - plan.json - main - Missing Common Tags: ["aws_rds_cluster_parameter_group.default"]
WARN - plan.json - main - Missing Common Tags: ["aws_rds_cluster_parameter_group.pgaudit"]
WARN - plan.json - main - Missing Common Tags: ["aws_secretsmanager_secret.app_db_user"]
WARN - plan.json - main - Missing Common Tags: ["aws_secretsmanager_secret.database_user"]
WARN - plan.json - main - Missing Common Tags: ["module.rds_proxy.aws_cloudwatch_log_group.this[0]"]
WARN - plan.json - main - Missing Common Tags: ["module.rds_proxy.aws_db_proxy.this[0]"]
WARN - plan.json - main - Missing Common Tags: ["module.rds_proxy.aws_db_proxy_endpoint.this[\"read_only\"]"]
WARN - plan.json - main - Missing Common Tags: ["module.rds_proxy.aws_db_proxy_endpoint.this[\"read_write\"]"]
WARN - plan.json - main - Missing Common Tags: ["module.rds_proxy.aws_iam_role.this[0]"]

37 tests, 19 passed, 18 warnings, 0 failures, 0 exceptions

```

</details>
